name: "insulator_yolo_pre"
backend: "python"
max_batch_size: 0

input [
	{ name: "jpeg" data_type: TYPE_STRING dims: [ 1 ] }
]

output [
	{ name: "images" data_type: TYPE_FP32 dims: [ 1, 3, 1280, 1280 ] },
	{ name: "meta"   data_type: TYPE_FP32 dims: [ 1, 5 ] }  # scale,pad_x,pad_y,orig_w,orig_h
]
